app/views/root/index.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
      <div class="post_profile">
        <% @user = User.find(post.user_id)%>