app/controllers/post_controller.rb

INSERT INTO `posts` (`caption`, `image`, `location`, `created_at`, `updated_at`, `user_id`) VALUES ('asdfasdf 😒', '', '', '2024-01-03 12:59:16.063448', '2024-01-03 12:59:16.063448', 1)
---
  def create_post
    caption = params[:caption]
    image = params[:image]
    location = params[:location]
    user_id = current_user.id
    @post = Post.new(caption: caption, image: image, location: location, user_id: user_id)

    if @post.save

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
---
  def edit_post
    @post = Post.find(params[:id])

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = NULL LIMIT 1
UPDATE `posts` SET `posts`.`location` = 'Kumbakonam,Tamilnadu', `posts`.`updated_at` = '2023-12-28 07:58:41.728642' WHERE `posts`.`id` = 2
---
  def update_post
    @post = Post.find(params[:id])

    @post.caption = params[:caption]
    @post.image = params[:image]
    @post.location = params[:location]

    if @post.save

DELETE FROM `posts` WHERE `posts`.`id` = 3
---
  def delete_post
    Post.delete(params[:id])