app/controllers/session_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'vignesh@gmail.com' LIMIT 1
---
  def login_user
    @user = User.find_by(email: params[:email])