app/controllers/user_controller.rb

INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('Nelson', 'srvignesh000@gmail.com', '$2a$12$nLwDUWsKpvshHxHGnRUz0OTjybq4cOYI1E57ovR7zkj76rFoNgvla', '2023-12-30 09:55:59.611627', '2023-12-30 09:55:59.611627')
---
  def create
    name = params[:name]
    email = params[:email]
    password = params[:password]

    @user = User.new(name: name, email: email, password: password)

    if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'vignesh@gmail.com' LIMIT 1
UPDATE `users` SET `users`.`name` = 'Vignesh SR', `users`.`password_digest` = '$2a$12$jVqz84TRgmW6j9zrvrTUieuyZyD/kHtfMY22ruWGFFYhyrrOmusqy', `users`.`updated_at` = '2023-12-30 06:36:51.366187' WHERE `users`.`id` = 1
---
  def update
    @user = User.find_by(email: params[:email])
    @user.name = params[:name]
    @user.password = params[:password]

    if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'srvignesh000@gmail.com' LIMIT 1
---
  def password_reset_create
    @user = User.find_by(email: params[:email])

    if @user.present?

UPDATE `users` SET `users`.`password_digest` = '$2a$12$kh9zzGDYKvLWSIO/qrjBOOuz2GFoWUKnuWhLk013/WGNFZoH7ZQBG', `users`.`updated_at` = '2023-12-30 11:05:50.045854' WHERE `users`.`id` = 9
---
  def password_reset_update
    @user = User.find_signed(params[:token], purpose: "password_reset")

    if @user.update(password: params[:password])